// LICENSE : MIT
"use strict";
export default {
    rules: {
        "1.2.1.句点(。)と読点(、)": require("./1.2.1.句点(。)と読点(、)"),
        "1.2.2.ピリオド(.)とカンマ(,)": require("./1.2.2.ピリオド(.)とカンマ(,)"),
        "2.2.2.算用数字と漢数字の使い分け": require("./2.2.2.算用数字と漢数字の使い分け"),
        "2.2.3.一部の助数詞の表記": require("./2.2.3.一部の助数詞の表記"),
        "3.1.1.全角文字と半角文字の間": require("./3.1.1.全角文字と半角文字の間"),
        "3.1.2.全角文字どうし": require("./3.1.2.全角文字どうし"),
        "3.3.かっこ類と隣接する文字の間のスペースの有無": require("./3.3.かっこ類と隣接する文字の間のスペースの有無"),
        "4.1.1.句点(。)": require("./4.1.1.句点(。)")
    },
    rulesConfig: {
        "1.2.1.句点(。)と読点(、)": true,
        "1.2.2.ピリオド(.)とカンマ(,)": true,
        "2.2.2.算用数字と漢数字の使い分け": true,
        "2.2.3.一部の助数詞の表記": true,
        "3.1.1.全角文字と半角文字の間": true,
        "3.1.2.全角文字どうし": true,
        "3.3.かっこ類と隣接する文字の間のスペースの有無": true,
        "4.1.1.句点(。)": true
    }
};
